
## Terraform plan for environment: `dev`

**Commit:** aced412a3af974b6030e0add1a5b77c07db86735


**API version:** 9e1eaa40e4
**CLI version:** aced412a3a
**Selfserve version:** 187c5a92a9
**Internal version:** 9a7cb0edb6
**search version:** 805133fd06

### Plan summary

`6 to add, 83 to change, 1 to destroy`

**🆕 Creates**

```tf
module.service.aws_cloudwatch_log_group.this["sas-mi-extract"]
module.service.module.batch.aws_batch_job_definition.this["sas-mi-extract"]
module.service.module.cloudwatch_log-metric-filter["sas-mi-extract"].aws_cloudwatch_log_metric_filter.this[0]
module.service.module.ecs_service["api"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["internal"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["selfserve"].aws_ecs_task_definition.this[0]
```
**🗑️ Deletes**

```tf
null_resource.deployed_versions
```
**📖 Reads**

```tf
module.service.module.ecs_service["api"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["internal"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["selfserve"].data.aws_ecs_task_definition.this[0]
module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0]
```
**🔄 Updates**

```tf
module.service.aws_cloudwatch_dashboard.this
module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"]
module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"]
module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"]
module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"]
module.service.module.batch.aws_batch_job_definition.this["cns"]
module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"]
module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"]
module.service.module.batch.aws_batch_job_definition.this["database-maintenance"]
module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"]
module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"]
module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"]
module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"]
module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"]
module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"]
module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"]
module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"]
module.service.module.batch.aws_batch_job_definition.this["international-goods-export"]
module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"]
module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"]
module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"]
module.service.module.batch.aws_batch_job_definition.this["process-cl"]
module.service.module.batch.aws_batch_job_definition.this["process-company-profile"]
module.service.module.batch.aws_batch_job_definition.this["process-inbox"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency-dlq"]
module.service.module.batch.aws_batch_job_definition.this["process-ntu"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-community-licences"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-ecmt-accept"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-general"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-irhp-allocate"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-print"]
module.service.module.batch.aws_batch_job_definition.this["psv-operator-list-export"]
module.service.module.batch.aws_batch_job_definition.this["remove-read-audit"]
module.service.module.batch.aws_batch_job_definition.this["resolve-payments"]
module.service.module.batch.aws_batch_job_definition.this["system-parameter"]
module.service.module.batch.aws_batch_job_definition.this["transxchange-consumer"]
module.service.module.ecs_service["api"].aws_ecs_service.this[0]
module.service.module.ecs_service["internal"].aws_ecs_service.this[0]
module.service.module.ecs_service["selfserve"].aws_ecs_service.this[0]
module.service.module.eventbridge.aws_iam_policy.additional_inline[0]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-clean-up-variations"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-close-expired-windows"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-cns"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-company-profile-dlq"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-create-psv-licence-surrender-task"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-digital-continuation-reminders"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-duplicate-vehicle-warning"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-enqueue-ch-compare"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-expire-bus-registration"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-flag-urgent-tasks"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-inspection-request-email"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-interim-end-date-enforcement"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-international-goods-export"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-last-tm-letter"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-licence-status-rules"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-mark-expired-permits"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-company-profile"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-inbox"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-insolvency"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-insolvency-dlq"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-ntu"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-community-licences"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-disc-generation"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-disc-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-ecmt-accept"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-general"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-irhp-allocate"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-permit-generation"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-permit-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-psv-operator-list-export"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-remove-read-audit"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-resolve-payments"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-transxchange-consumer"]
```


----

<details data-gh-workflow="dev-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # null_resource.deployed_versions must be replaced
-/+ resource "null_resource" "deployed_versions" {
      ~ id       = "4962786710923623228" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "deployed_api_image_tag"       = "bde9af828f" -> "9e1eaa40e4"
          ~ "deployed_cli_image_tag"       = "bde9af828f" -> "aced412a3a"
          ~ "deployed_internal_image_tag"  = "35a6b92b11" -> "9a7cb0edb6"
          ~ "deployed_selfserve_image_tag" = "35a6b92b11" -> "187c5a92a9"
            # (1 unchanged element hidden)
        }
    }

  # module.service.aws_cloudwatch_dashboard.this will be updated in-place
  ~ resource "aws_cloudwatch_dashboard" "this" {
      ~ dashboard_body = jsonencode(
          ~ {
              ~ widgets = [
                    # (1 unchanged element hidden)
                    {
                        height     = 6
                        properties = {
                            query   = <<-EOT
                                SOURCE '/aws/events/vol-app-dev-failures' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                            region  = "eu-west-1"
                            stacked = false
                            title   = "Batch failure logs"
                            view    = "table"
                        }
                        type       = "log"
                        width      = 18
                        x          = 12
                        y          = 6
                    },
                  ~ {
                      ~ properties = {
                          ~ metrics = [
                                # (45 unchanged elements hidden)
                                [
                                    "AWS/Logs",
                                    "IncomingLogEvents",
                                    "LogGroupName",
                                    "/aws/batch/vol-app-dev-search",
                                ],
                              + [
                                  + "AWS/Logs",
                                  + "IncomingLogEvents",
                                  + "LogGroupName",
                                  + "/aws/batch/vol-app-dev-sas-mi-extract",
                                ],
                            ]
                            # (4 unchanged attributes hidden)
                        }
                        # (5 unchanged attributes hidden)
                    },
                    {
                        height     = 1
                        properties = {
                            query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-dev-ch-vs-olcs-diffs' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                            region  = "eu-west-1"
                            stacked = false
                            title   = "ch-vs-olcs-diffs-logs"
                            view    = "table"
                        }
                        type       = "log"
                        width      = 6
                        x          = 0
                        y          = 0
                    },
                    # (44 unchanged elements hidden)
                    {
                        height     = 1
                        properties = {
                            query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-dev-search' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                            region  = "eu-west-1"
                            stacked = false
                            title   = "search-logs"
                            view    = "table"
                        }
                        type       = "log"
                        width      = 6
                        x          = 0
                        y          = 0
                    },
                  + {
                      + height     = 1
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-dev-sas-mi-extract' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "sas-mi-extract-logs"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 6
                      + x          = 0
                      + y          = 0
                    },
                ]
            }
        )
        id             = "batch-vol-app-dev"
        # (2 unchanged attributes hidden)
    }

  # module.service.aws_cloudwatch_log_group.this["sas-mi-extract"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-dev-sas-mi-extract"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-cancel-unsubmitted-bilateral:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-cancel-unsubmitted-bilateral:105"
        name                       = "vol-app-dev-cancel-unsubmitted-bilateral"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-ch-vs-olcs-diffs:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-ch-vs-olcs-diffs:105"
        name                       = "vol-app-dev-ch-vs-olcs-diffs"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-clean-up-variations:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-clean-up-variations:105"
        name                       = "vol-app-dev-clean-up-variations"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-close-expired-windows:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-close-expired-windows:105"
        name                       = "vol-app-dev-close-expired-windows"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["cns"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-cns:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-cns:105"
        name                       = "vol-app-dev-cns"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-company-profile-dlq:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-company-profile-dlq:105"
        name                       = "vol-app-dev-company-profile-dlq"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-create-psv-licence-surrender-task:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-create-psv-licence-surrender-task:105"
        name                       = "vol-app-dev-create-psv-licence-surrender-task"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-delete:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-delete:105"
        name                       = "vol-app-dev-data-retention-delete"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-populate:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-populate:105"
        name                       = "vol-app-dev-data-retention-populate"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-postcheck:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-postcheck:105"
        name                       = "vol-app-dev-data-retention-postcheck"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-precheck:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-precheck:105"
        name                       = "vol-app-dev-data-retention-precheck"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["database-maintenance"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-database-maintenance:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-database-maintenance:105"
        name                       = "vol-app-dev-database-maintenance"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-digital-continuation-reminders:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-digital-continuation-reminders:105"
        name                       = "vol-app-dev-digital-continuation-reminders"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-duplicate-vehicle-warning:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-duplicate-vehicle-warning:105"
        name                       = "vol-app-dev-duplicate-vehicle-warning"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-enqueue-ch-compare:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-enqueue-ch-compare:105"
        name                       = "vol-app-dev-enqueue-ch-compare"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-expire-bus-registration:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-expire-bus-registration:105"
        name                       = "vol-app-dev-expire-bus-registration"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-flag-urgent-tasks:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-flag-urgent-tasks:105"
        name                       = "vol-app-dev-flag-urgent-tasks"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-import-users-from-csv:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-import-users-from-csv:105"
        name                       = "vol-app-dev-import-users-from-csv"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-inspection-request-email:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-inspection-request-email:105"
        name                       = "vol-app-dev-inspection-request-email"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-interim-end-date-enforcement:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-interim-end-date-enforcement:105"
        name                       = "vol-app-dev-interim-end-date-enforcement"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["international-goods-export"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-international-goods-export:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-international-goods-export:105"
        name                       = "vol-app-dev-international-goods-export"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-last-tm-letter:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-last-tm-letter:105"
        name                       = "vol-app-dev-last-tm-letter"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-licence-status-rules:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-licence-status-rules:105"
        name                       = "vol-app-dev-licence-status-rules"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-mark-expired-permits:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-mark-expired-permits:105"
        name                       = "vol-app-dev-mark-expired-permits"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-cl"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-cl:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-cl:105"
        name                       = "vol-app-dev-process-cl"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-company-profile"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-company-profile:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-company-profile:105"
        name                       = "vol-app-dev-process-company-profile"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-inbox"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-inbox:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-inbox:105"
        name                       = "vol-app-dev-process-inbox"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-insolvency"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency:105"
        name                       = "vol-app-dev-process-insolvency"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-insolvency-dlq"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency-dlq:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency-dlq:105"
        name                       = "vol-app-dev-process-insolvency-dlq"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-ntu"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-ntu:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-ntu:105"
        name                       = "vol-app-dev-process-ntu"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-community-licences"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-community-licences:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-community-licences:105"
        name                       = "vol-app-dev-process-queue-community-licences"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-generation"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-disc-generation:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-disc-generation:105"
        name                       = "vol-app-dev-process-queue-disc-generation"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-print"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-disc-print:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-disc-print:105"
        name                       = "vol-app-dev-process-queue-disc-print"
      ~ revision                   = 105 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-ecmt-accept"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-ecmt-accept:105" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "bde9af828f" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "aced412a3a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bde9af828f" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:aced412a3a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                   ... (truncated, see full plan in the workflow run logs)
```

</details>